{
    "version": 1,
    "display": [
        {
            "type": "announcement",
            "title": "Limited development",
            "text": "Decision has been made to continue with development",
            "url": ""
        }
    ],
    "map": [
    ],
    "mainMenuText": [
        "Update 1.8.1",
        "- Added support to dynamically change external links in main menu / update prompts",
        "",
        "",
        "Update 1.8.0 [Backpack, NightVision and Loot update]",
        "- Fully configurable loot - all block loot pools are now located in pubgmc folder in gamedata. This is currently done for loot spawners and airdrops",
        "- Custom inventory (Accessible by + sign from survival inventory) for backpacks, ghillie suit and night vision",
        "- Backpack functionality implementation - inventory is now blocked depending on your backpack level",
        "- Full rework of night vision goggles - now rendered on player, no longer relies on vanilla's night vision potion effect",
        "- Backpacks are now rendered on players",
        "- Added more backpack variants - Forest, Desert and Snow",
        "- Added config option to disable backpack inventory blocking",
        "- Added config option to enable weapon knockback",
        "- Reloading no longer blocks sprinting",
        "- Decreased S1897 firerate",
        "- Weapon balancing - increased velocity of most weapons",
        "- Fixed issue with left click interactions which could prevent shooting in some cases",
        "- Fixed issue which could cause crash when AI shot flare",
        "- Fixed issue with airdrop inventory saving and synchonization to client",
        "- Fixed issue with death crate placements",
        "- Fixed issue with airdrop crate placements",
        "- Fixed issue with death messages when player got shot by weapon",
        "- Fixed issue with missing window particles when broken",
        "- Fixed issue which allowed you to initiate reload when already reloading",
        "- Fixed shooting animation synchronization issues for win94, s1897 and kar98k",
        "",
        "",
        "Update 1.7.3",
        "- Fixed issue where you could get run over by your own car while driving",
        "- Fixed issues which could cause crashing while playing BattleRoyale game type",
        "- Fixed deathcrate spawning logic which could previously cause replacement of existing blocks",
        "- Fixed issues with night vision overlay not being properly synchronized",
        "- Reworked all commands - this means more options, better tab completions etc.",
        "- Shields are no longer rendered when holding gun",
        "- Vehicle lighting improvements",
        "- Scope shader compatibility improvements",
        "- Item texture improvements",
        "- Boost overlay texture improvements",
        "",
        "",
        "Update 1.7.1 & 1.7.2",
        "- Improvements to weapon damage sources which should improve compatibility with other mods",
        "- New client config option for disabling main menu",
        "",
        "",
        "Status update 29/3/2023",
        "Development of this mod will continue, mostly for bugfixes and minor QoL changes",
        "",
        "",
        "",
        "Update 1.7.0 [Animation Update]",
        "Changelog",
        "- Reworked ALL animations and added some new ones",
        "- New scope render system",
        "- Hand rendering",
        "- New third person aim animation",
        "- Optimized weapon renderers",
        "- Reworked reloading backend",
        "- Variable equip speeds for each weapon type",
        "- Reduced recoil for most weapons",
        "- Custom bobbing animation for weapons",
        "- Customizable mouse sensitivity for each scope",
        "- Attachments now affect aim speed",
        "- Added bunch of props",
        "- Fixed server crashes related to game system",
        "- Fixed errors related to loot generation",
        "- Fixed some weapon models",
        "- Fixed FOV resetting to 70 after exiting ADS mode",
        "- Fixed mouse sensitivity resetting when using scopes",
        "- Fixed collision hitboxes on some props",
        "",
        "",
        "Update 1.6.4",
        "Changelog",
        "- Reworked all weapon models",
        "- Optimized loot rendering - configure render distance in config",
        "- New attachment system:",
        "   - Optimizations",
        "   - UI overhaul. Compatible slots are now highlighted",
        "   - Fixed position of the gun in UI",
        "- Proning now reduces recoil",
        "- Reworked aiming system backend",
        "- Content loading improvements",
        "- Added custom reticles to config",
        "- Updated energy drink model",
        "- Stabilized firerate of automatic weapons",
        "- Fixed targets not registering headshots",
        "- Fixed crashing related to flare gun tooltip",
        "- Fixed speed effect applied even when your boost value was low",
        "- Firemode is now individual for every item",
        "- Fixed grenades exploding infinitely when moved to off hand slot",
        "- Fixed loot not syncing on clear command",
        "- Now requires Configuration 1.0.3.1 and higher",
        "Known issues:",
        "- No recoil animation for weapons. Will be fixed by new animation system",
        "",
        "",
        "Update 1.6.3 [BUGFIX UPDATE]",
        "Changelog",
        "- Various optimizations",
        "- New config system. Requires Configuration library",
        "- Improved parachute and vehicle controls",
        "- Custom main menu (as you can propably see)",
        "- Reworked boost system",
        "- Fixed prone animation",
        "- Fixed laggy vehicle movement",
        "- Fixed unstable burst fire"
    ],
    "vips": [
        "Tapio",
        "Cash"
    ],
    "urls": {
        "discord": "https://discord.gg/WEFYxwS8E3",
        "patreon": "https://www.patreon.com/tnt_team",
        "homepage": "https://www.curseforge.com/minecraft/mc-mods/pubgmc-mod"
    }
}
